## Plan Result (stg-global)




<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fis-ds-update-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;judicial-payments&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat"
        name                                 = "hmcts-aat"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (11 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-adoption" -> "healthProbeSettings-judicial-payments"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/adoption"
          ~ load_balancing_name = "loadBalancingSettings-adoption" -> "loadBalancingSettings-judicial-payments"
          ~ name                = "adoption" -> "judicial-payments"

          ~ backend {
              ~ host_header = "adoption.aat.platform.hmcts.net" -> "judicial-payments.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-adoption-web" -> "healthProbeSettings-adoption"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/adoption-web"
          ~ load_balancing_name = "loadBalancingSettings-adoption-web" -> "loadBalancingSettings-adoption"
          ~ name                = "adoption-web" -> "adoption"

          ~ backend {
              ~ host_header = "adoption-web.aat.platform.hmcts.net" -> "adoption.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-probate" -> "healthProbeSettings-adoption-web"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/probate"
          ~ load_balancing_name = "loadBalancingSettings-probate" -> "loadBalancingSettings-adoption-web"
          ~ name                = "probate" -> "adoption-web"

          ~ backend {
              ~ host_header = "probate.aat.platform.hmcts.net" -> "adoption-web.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-idam-web-public" -> "healthProbeSettings-probate"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/idam-web-public"
          ~ load_balancing_name = "loadBalancingSettings-idam-web-public" -> "loadBalancingSettings-probate"
          ~ name                = "idam-web-public" -> "probate"

          ~ backend {
              ~ host_header = "idam-web-public.aat.platform.hmcts.net" -> "probate.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-hmcts-access" -> "healthProbeSettings-idam-web-public"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/hmcts-access"
          ~ load_balancing_name = "loadBalancingSettings-hmcts-access" -> "loadBalancingSettings-idam-web-public"
          ~ name                = "hmcts-access" -> "idam-web-public"

          ~ backend {
              ~ host_header = "hmcts-access.aat.platform.hmcts.net" -> "idam-web-public.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-paybubble" -> "healthProbeSettings-hmcts-access"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/paybubble"
          ~ load_balancing_name = "loadBalancingSettings-paybubble" -> "loadBalancingSettings-hmcts-access"
          ~ name                = "paybubble" -> "hmcts-access"

          ~ backend {
              ~ host_header = "paybubble.aat.platform.hmcts.net" -> "hmcts-access.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-bar" -> "healthProbeSettings-paybubble"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/bar"
          ~ load_balancing_name = "loadBalancingSettings-bar" -> "loadBalancingSettings-paybubble"
          ~ name                = "bar" -> "paybubble"

          ~ backend {
              ~ host_header = "bar.aat.platform.hmcts.net" -> "paybubble.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fees-register" -> "healthProbeSettings-bar"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/fees-register"
          ~ load_balancing_name = "loadBalancingSettings-fees-register" -> "loadBalancingSettings-bar"
          ~ name                = "fees-register" -> "bar"

          ~ backend {
              ~ host_header = "fees-register.aat.platform.hmcts.net" -> "bar.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-idam-web-admin" -> "healthProbeSettings-fees-register"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/idam-web-admin"
          ~ load_balancing_name = "loadBalancingSettings-idam-web-admin" -> "loadBalancingSettings-fees-register"
          ~ name                = "idam-web-admin" -> "fees-register"

          ~ backend {
              ~ host_header = "idam-web-admin.aat.platform.hmcts.net" -> "fees-register.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-idam-user-dashboard" -> "healthProbeSettings-idam-web-admin"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/idam-user-dashboard"
          ~ load_balancing_name = "loadBalancingSettings-idam-user-dashboard" -> "loadBalancingSettings-idam-web-admin"
          ~ name                = "idam-user-dashboard" -> "idam-web-admin"

          ~ backend {
              ~ host_header = "idam-user-dashboard.aat.platform.hmcts.net" -> "idam-web-admin.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-reformscan" -> "healthProbeSettings-idam-user-dashboard"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/reformscan"
          ~ load_balancing_name = "loadBalancingSettings-reformscan" -> "loadBalancingSettings-idam-user-dashboard"
          ~ name                = "reformscan" -> "idam-user-dashboard"

          ~ backend {
              ~ address     = "firewall-prod-int-palo-reformscanaat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
              ~ host_header = "reformscanaat.blob.core.windows.net" -> "idam-user-dashboard.aat.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-reformscanstg" -> "healthProbeSettings-reformscan"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/reformscanstg"
          ~ load_balancing_name = "loadBalancingSettings-reformscanstg" -> "loadBalancingSettings-reformscan"
          ~ name                = "reformscanstg" -> "reformscan"

          ~ backend {
              ~ address     = "firewall-prod-int-palo-reformscanaatstg.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-reformscanaat.uksouth.cloudapp.azure.com"
              ~ host_header = "reformscanaatstaging.blob.core.windows.net" -> "reformscanaat.blob.core.windows.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-ds-ui" -> "healthProbeSettings-reformscanstg"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/ds-ui"
          ~ load_balancing_name = "loadBalancingSettings-ds-ui" -> "loadBalancingSettings-reformscanstg"
          ~ name                = "ds-ui" -> "reformscanstg"

          ~ backend {
              ~ address     = "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-reformscanaatstg.uksouth.cloudapp.azure.com"
              ~ host_header = "ds-ui.aat.platform.hmcts.net" -> "reformscanaatstaging.blob.core.windows.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fis-ds-web" -> "healthProbeSettings-ds-ui"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/fis-ds-web"
          ~ load_balancing_name = "loadBalancingSettings-fis-ds-web" -> "loadBalancingSettings-ds-ui"
          ~ name                = "fis-ds-web" -> "ds-ui"

          ~ backend {
              ~ host_header = "fis-ds-web.aat.platform.hmcts.net" -> "ds-ui.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sptribs-frontend" -> "healthProbeSettings-fis-ds-web"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/sptribs-frontend"
          ~ load_balancing_name = "loadBalancingSettings-sptribs-frontend" -> "loadBalancingSettings-fis-ds-web"
          ~ name                = "sptribs-frontend" -> "fis-ds-web"

          ~ backend {
              ~ host_header = "sptribs-frontend.aat.platform.hmcts.net" -> "fis-ds-web.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-privatelaw" -> "healthProbeSettings-fis-ds-update-web"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/privatelaw"
          ~ load_balancing_name = "loadBalancingSettings-privatelaw" -> "loadBalancingSettings-fis-ds-update-web"
          ~ name                = "privatelaw" -> "fis-ds-update-web"

          ~ backend {
              ~ host_header = "privatelaw.aat.platform.hmcts.net" -> "fis-ds-update-web.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-hmi-apim" -> "healthProbeSettings-sptribs-frontend"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/hmi-apim"
          ~ load_balancing_name = "loadBalancingSettings-hmi-apim" -> "loadBalancingSettings-sptribs-frontend"
          ~ name                = "hmi-apim" -> "sptribs-frontend"

          ~ backend {
              ~ address     = "firewall-prod-int-palo-hmiapimaat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
              ~ host_header = "hmi-apim.staging.platform.hmcts.net" -> "sptribs-frontend.aat.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-cft-api-mgmt" -> "healthProbeSettings-privatelaw"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/cft-api-mgmt"
          ~ load_balancing_name = "loadBalancingSettings-cft-api-mgmt" -> "loadBalancingSettings-privatelaw"
          ~ name                = "cft-api-mgmt" -> "privatelaw"

          ~ backend {
              ~ address     = "firewall-prod-int-palo-cftapimgmtstg.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
              ~ host_header = "cft-api-mgmt.aat.platform.hmcts.net" -> "privatelaw.aat.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-paymentoutcome-web" -> "healthProbeSettings-hmi-apim"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/paymentoutcome-web"
          ~ load_balancing_name = "loadBalancingSettings-paymentoutcome-web" -> "loadBalancingSettings-hmi-apim"
          ~ name                = "paymentoutcome-web" -> "hmi-apim"

          ~ backend {
              ~ address     = "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-hmiapimaat.uksouth.cloudapp.azure.com"
              ~ host_header = "paymentoutcome-web.aat.platform.hmcts.net" -> "hmi-apim.staging.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-em-icp" -> "healthProbeSettings-cft-api-mgmt"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/em-icp"
          ~ load_balancing_name = "loadBalancingSettings-em-icp" -> "loadBalancingSettings-cft-api-mgmt"
          ~ name                = "em-icp" -> "cft-api-mgmt"

          ~ backend {
              ~ address     = "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cftapimgmtstg.uksouth.cloudapp.azure.com"
              ~ host_header = "em-icp.aat.platform.hmcts.net" -> "cft-api-mgmt.aat.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-paymentoutcome-web"
          + load_balancing_name = "loadBalancingSettings-paymentoutcome-web"
          + name                = "paymentoutcome-web"

          + backend {
              + address     = "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "paymentoutcome-web.aat.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-em-icp"
          + load_balancing_name = "loadBalancingSettings-em-icp"
          + name                = "em-icp"

          + backend {
              + address     = "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "em-icp.aat.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      ~ backend_pool_health_probe {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-adoption"
          ~ name                = "healthProbeSettings-adoption" -> "healthProbeSettings-judicial-payments"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-adoption-web"
          ~ name                = "healthProbeSettings-adoption-web" -> "healthProbeSettings-adoption"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-probate"
          ~ name                = "healthProbeSettings-probate" -> "healthProbeSettings-adoption-web"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-idam-web-public"
          ~ name                = "healthProbeSettings-idam-web-public" -> "healthProbeSettings-probate"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-hmcts-access"
          ~ name                = "healthProbeSettings-hmcts-access" -> "healthProbeSettings-idam-web-public"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-paybubble"
          ~ name                = "healthProbeSettings-paybubble" -> "healthProbeSettings-hmcts-

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

   - "nfdiv-civil",
              + "nfdiv",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/nfdiv-civilHttpsRedirect"
          ~ name               = "nfdiv-civilHttpsRedirect" -> "nfdivHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "et-sya",
              + "nfdiv-apply",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/et-syaHttpsRedirect"
          ~ name               = "et-syaHttpsRedirect" -> "nfdiv-applyHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "ia-aip",
              + "nfdiv-civil",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/ia-aipHttpsRedirect"
          ~ name               = "ia-aipHttpsRedirect" -> "nfdiv-civilHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "wa-proto-frontend",
              + "et-sya",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/wa-proto-frontendHttpsRedirect"
          ~ name               = "wa-proto-frontendHttpsRedirect" -> "et-syaHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "gateway-ccd",
              + "ia-aip",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/gateway-ccdHttpsRedirect"
          ~ name               = "gateway-ccdHttpsRedirect" -> "ia-aipHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "return-case-doc-ccd",
              + "wa-proto-frontend",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/return-case-doc-ccdHttpsRedirect"
          ~ name               = "return-case-doc-ccdHttpsRedirect" -> "wa-proto-frontendHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "pcq",
              + "gateway-ccd",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/pcqHttpsRedirect"
          ~ name               = "pcqHttpsRedirect" -> "gateway-ccdHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "lau",
              + "return-case-doc-ccd",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/lauHttpsRedirect"
          ~ name               = "lauHttpsRedirect" -> "return-case-doc-ccdHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "adoption",
              + "pcq",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/adoptionHttpsRedirect"
          ~ name               = "adoptionHttpsRedirect" -> "pcqHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "adoption-web",
              + "lau",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/adoption-webHttpsRedirect"
          ~ name               = "adoption-webHttpsRedirect" -> "lauHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "probate",
              + "judicial-payments",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/probateHttpsRedirect"
          ~ name               = "probateHttpsRedirect" -> "judicial-paymentsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-public",
              + "adoption",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/idam-web-publicHttpsRedirect"
          ~ name               = "idam-web-publicHttpsRedirect" -> "adoptionHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmcts-access",
              + "adoption-web",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/hmcts-accessHttpsRedirect"
          ~ name               = "hmcts-accessHttpsRedirect" -> "adoption-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paybubble",
              + "probate",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/paybubbleHttpsRedirect"
          ~ name               = "paybubbleHttpsRedirect" -> "probateHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "bar",
              + "idam-web-public",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/barHttpsRedirect"
          ~ name               = "barHttpsRedirect" -> "idam-web-publicHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fees-register",
              + "hmcts-access",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/fees-registerHttpsRedirect"
          ~ name               = "fees-registerHttpsRedirect" -> "hmcts-accessHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-admin",
              + "paybubble",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/idam-web-adminHttpsRedirect"
          ~ name               = "idam-web-adminHttpsRedirect" -> "paybubbleHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-user-dashboard",
              + "bar",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/idam-user-dashboardHttpsRedirect"
          ~ name               = "idam-user-dashboardHttpsRedirect" -> "barHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "reformscan",
              + "fees-register",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/reformscanHttpsRedirect"
          ~ name               = "reformscanHttpsRedirect" -> "fees-registerHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "reformscanstg",
              + "idam-web-admin",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/reformscanstgHttpsRedirect"
          ~ name               = "reformscanstgHttpsRedirect" -> "idam-web-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "ds-ui",
              + "idam-user-dashboard",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/ds-uiHttpsRedirect"
          ~ name               = "ds-uiHttpsRedirect" -> "idam-user-dashboardHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fis-ds-web",
              + "reformscan",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/fis-ds-webHttpsRedirect"
          ~ name               = "fis-ds-webHttpsRedirect" -> "reformscanHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sptribs-frontend",
              + "reformscanstg",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/sptribs-frontendHttpsRedirect"
          ~ name               = "sptribs-frontendHttpsRedirect" -> "reformscanstgHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "privatelaw",
              + "ds-ui",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/privatelawHttpsRedirect"
          ~ name               = "privatelawHttpsRedirect" -> "ds-uiHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmi-apim",
              + "fis-ds-web",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/hmi-apimHttpsRedirect"
          ~ name               = "hmi-apimHttpsRedirect" -> "fis-ds-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "cft-api-mgmt",
              + "fis-ds-update-web",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/cft-api-mgmtHttpsRedirect"
          ~ name               = "cft-api-mgmtHttpsRedirect" -> "fis-ds-update-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paymentoutcome-web",
              + "sptribs-frontend",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/paymentoutcome-webHttpsRedirect"
          ~ name               = "paymentoutcome-webHttpsRedirect" -> "sptribs-frontendHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "em-icp",
              + "privatelaw",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/em-icpHttpsRedirect"
          ~ name               = "em-icpHttpsRedirect" -> "privatelawHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ accepted_protocols = [
                "Http",
              - "Https",
            ]
          ~ frontend_endpoints = [
              - "wwwpaymentoutcome-web",
              + "hmi-apim",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/paymentoutcome-webwwwRedirect"
          ~ name               = "paymentoutcome-webwwwRedirect" -> "hmi-apimHttpsRedirect"
            # (2 unchanged attributes hidden)

          ~ redirect_configuration {
              - custom_host       = "paymentoutcome-web.aat.platform.hmcts.net" -> null
                # (2 unchanged attributes hidden)
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "cft-api-mgmt",
            ]
          + name               = "cft-api-mgmtHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "paymentoutcome-web",
            ]
          + name               = "paymentoutcome-webHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "em-icp",
            ]
          + name               = "em-icpHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "wwwpaymentoutcome-web",
            ]
          + name               = "paymentoutcome-webwwwRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "paymentoutcome-web.aat.platform.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (151 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["fis-ds-update-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/frontendEndpoints/fis-ds-update-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["judicial-payments"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/frontendEndpoints/judicial-payments"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1457,"Program":"tfcmt","SHA1":"","Target":"stg-global","Vars":{}} -->